      /if not defined(COPYRIGHT_DSPEC)
     h COPYRIGHT('V1.2.1 - 24.07.2019 - mailto: thomas.raddatz@tools400.de')
      /eof
      /endif
     d RTVCSTL_VERSION...
     d                 C                   '1.2.1'
     d RTVCSTL_DATE...
     d                 C                   '24.07.2019'
      *
