      /if not defined(COPYRIGHT_DSPEC)
     h COPYRIGHT('V1.2 - 16.07.2019 - mailto: thomas.raddatz@tools400.de')
      /eof
      /endif
     d RTVCSTL_VERSION...
     d                 C                   '1.2'
     d RTVCSTL_DATE...
     d                 C                   '16.07.2019'
      *
