**free
/if not defined(COPYRIGHT_DSPEC)
ctl-opt copyright('V1.3 - 03.06.2026 - mailto: thomas.raddatz@tools400.de');
/eof
/endif
dcl-c RTVCSTL_VERSION '1.3';
dcl-c RTVCSTL_DATE '03.06.2026';

