      /if not defined(qObj_t    )
      /define qObj_t
      * ============================================================= *
      *   Qualified object name                                       *
      *===============================================================*
      *
     d qObj_t          ds                  qualified           based(pDummy)
     d  name                         10a
     d  lib                          10a
      *
      /endif
